// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends[2]) {
    console.log('This is a large array that has 3 or more elemets');
} else {
    console.log('This is a small array that has less than 3 elements');
}


// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
    // Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

let arr = [29, 31, 29];
if ((arr[0] < arr[1] && arr[0] > arr[2]) || (arr[0] > arr[1] && arr[0] < arr[2])) {
        console.log(arr[0], 'Перше число знаходиться між двома іншими');
} else if ((arr[1] < arr[0] && arr[1] > arr[2]) || (arr[1] > arr[0] && arr[1] < arr[2])) {
    console.log(arr[1], 'Друге число знаходиться між двома іншими');
} else if ((arr[2] < arr[0] && arr[2] > arr[1]) || (arr[2] > arr[0] && arr[2] < arr[1])) {
    console.log(arr[2], 'Третє число знаходиться між двома іншими');
} else {
    console.log('Деякі числа однакові');
}


//  - Перепишіть конструкцію if з використанням умовного оператора '?':
//  let result;
//  if (a + b < 4) {
//     result = 'Мало';
//  } else {
//     result = 'Багато';
//  }


let result = 5 + 6 < 4? console.log('Мало') : console.log('Багато');

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором
let c = -23;
c > 0 ? console.log('Positive'): c === 0 ? console.log('Null'): console.log('Negative');
